ns96/STM32DiscVU/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include "stm32746g_discovery_audio.h"
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_sdram.h"
#include <math.h>
#include "FSKDecoder.h"
#include "VisualizerApp.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma location=0x2004c000
ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
#pragma location=0x2004c0a0
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __CC_ARM )  /* MDK ARM Compiler */

__attribute__((at(0x2004c000))) ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
__attribute__((at(0x2004c0a0))) ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __GNUC__ ) /* GNU Compiler */

ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".RxDecripSection"))); /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDecripSection")));   /* Ethernet Tx DMA Descriptors */
#endif

ETH_TxPacketConfig TxConfig;

ADC_HandleTypeDef hadc3;

CRC_HandleTypeDef hcrc;

DCMI_HandleTypeDef hdcmi;

DMA2D_HandleTypeDef hdma2d;

ETH_HandleTypeDef heth;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

// LTDC_HandleTypeDef hltdc; // Removed: Conflicts with hLtdcHandler from BSP

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;

SD_HandleTypeDef hsd1;
DMA_HandleTypeDef hdma_sdmmc1;

SPDIFRX_HandleTypeDef hspdif;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */
extern int lcd_io_putchar(int ch);

int __io_putchar(int ch)
{
  HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, 0xFFFF);
  // lcd_io_putchar(ch); // Temporarily disabled to prevent hangs
  return ch;
}

#define MODEM_CHUNK_SIZE 64
typedef struct {
    float samples[MODEM_CHUNK_SIZE];
} ModemChunk;

int16_t audio_buffer[AUDIO_BUFFER_SIZE] __attribute__((aligned(32)));
int16_t playback_buffer[AUDIO_BUFFER_SIZE] __attribute__((aligned(32)));
static volatile uint8_t audio_ready = 0;

osMessageQId modem_samples_queue_id;
osThreadId modemTaskHandle;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_ETH_Init(void);
// static void MX_FMC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
// static void MX_LTDC_Init(void);
// static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
// static void MX_SAI2_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SPDIFRX_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM12_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
void StartDefaultTask(void const * argument);
void StartModemTask(void const * argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  MX_USART1_UART_Init();
  printf("\r\n\r\n--- STM32 USART1 VCP INITIALIZED (115200) ---\r\n");

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();
  printf("PeriphCommonClock_Config OK\r\n");

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  printf("MX_GPIO_Init OK\r\n");
  MX_ADC3_Init();
  MX_CRC_Init();
  printf("MX_CRC_Init OK\r\n");
  MX_DCMI_Init();
  printf("MX_DCMI_Init OK\r\n");
  MX_DMA2D_Init();
  MX_ETH_Init();
  printf("MX_ETH_Init OK\r\n");
  // MX_FMC_Init();   // Handled by BSP_SDRAM
  MX_I2C1_Init();
  printf("MX_I2C1_Init OK\r\n");
  MX_I2C3_Init();
  printf("MX_I2C3_Init OK\r\n");
  // MX_LTDC_Init(); // Handled by BSP_LCD
  // MX_QUADSPI_Init();
  // printf("MX_QUADSPI_Init OK\r\n");
  MX_RTC_Init();
  printf("MX_RTC_Init OK\r\n");
  // MX_SAI2_Init(); // Handled by BSP_AUDIO_IN
  MX_SDMMC1_SD_Init();
  printf("MX_SDMMC1_SD_Init OK\r\n");
  MX_SPDIFRX_Init();
  printf("MX_SPDIFRX_Init OK\r\n");
  MX_SPI2_Init();
  printf("MX_SPI2_Init OK\r\n");
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
  MX_TIM12_Init();
  printf("TIMs Init OK\r\n");
  // MX_USART1_UART_Init(); // Moved earlier
  MX_USART6_UART_Init();
  printf("MX_USART6_UART_Init OK\r\n");
  MX_FATFS_Init();
  printf("MX_FATFS_Init OK\r\n");

  /* USER CODE BEGIN 2 */
  printf("\r\n--- STM32 DiscVu Booting ---\r\n");
  printf("System Clock: %lu MHz\r\n", HAL_RCC_GetSysClockFreq() / 1000000);
  /* USER CODE END 2 */

