ns96/STM32DiscVU/Core/Src/main.c
  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : DCMI_PWR_EN_Pin */
  GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
static void Audio_Bridge_Process(int16_t* inBuf, uint32_t samples) {
    static ModemChunk currentChunk;
    static int chunkIdx = 0;
    static float fsk_dc = 0.0f;
    extern float g_FSKGain;
    
    // Invalidate D-Cache for the buffer we just received from DMA
    SCB_InvalidateDCache_by_Addr((uint32_t*)inBuf, samples * 2);


    uint32_t numStereoSamples = samples / 2;
    uint32_t numModemSteps = numStereoSamples / 4;
    
    for (uint32_t i = 0; i < numModemSteps; i++) {
        float sumM = 0;
        for(int j=0; j<4; j++) {
            int baseIdx = (i*4 + j) * 2;
            sumM += (float)inBuf[baseIdx] + (float)inBuf[baseIdx + 1];
        }
        float monoAvg = (sumM / 8.0f) / 32768.0f;
        
        // DC Removal
        fsk_dc = 0.999f * fsk_dc + 0.001f * monoAvg;
        float cleanAvg = monoAvg - fsk_dc;
        
        float ganged = cleanAvg * g_FSKGain;
        if (ganged > 1.0f) ganged = 1.0f; else if (ganged < -1.0f) ganged = -1.0f;
        
        // Track max signal for debug (extern float g_MaxSignalLevel)
        extern float g_MaxSignalLevel;
        if (fabsf(ganged) > g_MaxSignalLevel) g_MaxSignalLevel = fabsf(ganged);

        currentChunk.samples[chunkIdx++] = ganged;
        
        if (chunkIdx >= MODEM_CHUNK_SIZE) {
            if (modem_samples_queue_id != NULL) {
                BaseType_t xHigherPriorityTaskWoken = pdFALSE;
                if (xQueueSendFromISR(modem_samples_queue_id, &currentChunk, &xHigherPriorityTaskWoken) != pdPASS) {
                    static uint32_t last_q_err = 0;
                    if (HAL_GetTick() - last_q_err > 1000) {
                        printf("[FSK] Queue FULL! Dropping samples.\r\n");
                        last_q_err = HAL_GetTick();
                    }
                }
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            }
            chunkIdx = 0;
        }
    }
}

void BSP_AUDIO_IN_TransferComplete_CallBack(void) {
    memcpy(&playback_buffer[AUDIO_BUFFER_SIZE / 2], &audio_buffer[AUDIO_BUFFER_SIZE / 2], AUDIO_BUFFER_SIZE); // copy in half-buffer size in bytes
    SCB_CleanDCache_by_Addr((uint32_t*)&playback_buffer[AUDIO_BUFFER_SIZE / 2], AUDIO_BUFFER_SIZE);
    
    Audio_Bridge_Process(&audio_buffer[AUDIO_BUFFER_SIZE / 2], AUDIO_BUFFER_SIZE / 2);
    audio_ready |= 1; // Mark second half ready
}

void BSP_AUDIO_IN_HalfTransfer_CallBack(void) {
    memcpy(&playback_buffer[0], &audio_buffer[0], AUDIO_BUFFER_SIZE); // copy in half-buffer size in bytes
    SCB_CleanDCache_by_Addr((uint32_t*)&playback_buffer[0], AUDIO_BUFFER_SIZE);

    Audio_Bridge_Process(&audio_buffer[0], AUDIO_BUFFER_SIZE / 2);
    audio_ready |= 2; // Mark first half ready
}

void BSP_AUDIO_IN_Error_CallBack(void) {
    Error_Handler();
}

// Modem Task: Process FSK Logic in high-priority background
extern FSK_Modem g_Modem;
extern bool g_ShowFSK;
extern void addFSKChar(char c);

void StartModemTask(void const * argument) {
    printf("[MODEM_TASK] Started\r\n");
    
    // Explicit Init here in the task context
    extern float g_BaudCorrectionFactor;
    FSK_Config fskCfg = {1200.0f, 2200.0f, 1200.0f, 12000.0f, 0.1f, g_BaudCorrectionFactor, false};
    FSK_Init(&g_Modem, fskCfg);
    
    bool lastCarrier = false;
    for(;;) {
        ModemChunk rxChunk;
        if (xQueueReceive(modem_samples_queue_id, &rxChunk, portMAX_DELAY) == pdTRUE) {
            static uint32_t last_rx_debug = 0;
            if (HAL_GetTick() - last_rx_debug > 2000) {
                 float pwr = 0.0f;
                 for(int k=0; k<MODEM_CHUNK_SIZE; k++) pwr += fabsf(rxChunk.samples[k]);
                 printf("[MODEM] Rx Chunk OK. AvgPwr: %.4f | Carrier: %d\r\n", pwr/64.0f, g_Modem.carrier);
                 last_rx_debug = HAL_GetTick();
            }

            if (g_ShowFSK) {
                for (int i = 0; i < MODEM_CHUNK_SIZE; i++) {
                    char c = FSK_Process(&g_Modem, rxChunk.samples[i]);
                    if (c) addFSKChar(c);
                    
