ns96/STM32DiscVU/Core/Src/main.c
                    if (lastCarrier && !g_Modem.carrier) {
                        const char* msg = "\n### NOCARRIER\n";
                        while(*msg) addFSKChar(*msg++);
                    }
                    lastCarrier = g_Modem.carrier;
                }
            } else {
                lastCarrier = false; // Reset if FSK is hidden
            }
        }
    }
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_HOST */
  MX_USB_HOST_Init();
  /* USER CODE BEGIN 5 */
  printf("[TASK] Started\r\n");

  // Initialize SDRAM first as in JMinimodem-Cube
  printf("[SDRAM] Initializing...\r\n");
  if (BSP_SDRAM_Init() != SDRAM_OK) {
      printf("[SDRAM] Init FAILED!\r\n");
  } else {
      printf("[SDRAM] Init OK\r\n");
  }

  printf("[FATFS] Mounting SD card (delayed)...\r\n");
  if (f_mount(&SDFatFS, (TCHAR const*)SDPath, 0) != FR_OK) {
      printf("[FATFS] Mount FAILED!\r\n");
  } else {
      printf("[FATFS] Mount OK\r\n");
  }

  printf("[LCD/AUDIO] Initializing...\r\n");
  Visualizer_Init();
  printf("[LCD/AUDIO] OK\r\n");

  /* Infinite loop */
  uint32_t last_heartbeat = 0;
  printf("StartDefaultTask: Runtime Loop Started.\r\n");
  for(;;)
  {
    if (HAL_GetTick() - last_heartbeat > 2000) {
        printf("Heartbeat: StartDefaultTask is running... (audio_ready: %d)\r\n", audio_ready);
        last_heartbeat = HAL_GetTick();
    }

    if (audio_ready & 2) { // First Half (HT)
        audio_ready &= ~2;
        Visualizer_ProcessAudio(&audio_buffer[0], AUDIO_BUFFER_SIZE/2);
    }
    if (audio_ready & 1) { // Second Half (TC)
        audio_ready &= ~1;
        Visualizer_ProcessAudio(&audio_buffer[AUDIO_BUFFER_SIZE/2], AUDIO_BUFFER_SIZE/2);
    }
    
    static uint32_t last_update = 0;
    if (HAL_GetTick() - last_update > 5000) {
        printf("[DEBUG] Main Loop Heartbeat.\r\n");
        last_update = HAL_GetTick();
    }

    Visualizer_Update();
    
    osDelay(1);
  }
  /* USER CODE END 5 */
}

 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x0;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  printf("\r\n!!! ERROR_HANDLER CALLED !!!\r\n");
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

/* USER CODE END 4 */
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
